//TCBIMSP JOB (ACCT),'IMS CKP PILOT',CLASS=A,MSGCLASS=H,
// MSGLEVEL=(1,1),NOTIFY=&SYSUID
//ALLOC EXEC PGM=IEFBR14
//LOAD DD DSN=&&LOAD,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
//DBD DD DSN=&&DBD,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
//PSB DD DSN=&&PSB,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
//A0 EXEC PGM=ASMA90,REGION=64M,PARM='OBJECT,NODECK'
//SYSLIB DD DSN=IMS.V15R1M0.SDFSMAC,DISP=SHR
//SYSLIN DD DSN=&&OBJ0,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
         DBD NAME=TCBCKDB,ACCESS=(HDAM,OSAM),                          X
               RMNAME=(DFSHDC40,1,10,1000)
         DATASET DD1=CKPDB,SIZE=4096
         SEGM NAME=CKPROOT,PARENT=0,BYTES=404
         FIELD NAME=(CASEKEY,SEQ,U),BYTES=4,START=1,TYPE=C
         DBDGEN
         FINISH
         END
/*
//B0 EXEC PGM=IEWL,PARM='LIST,XREF',COND=(0,NE,A0)
//SYSLIN DD DSN=&&OBJ0,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=&&DBD(TCBCKDB),DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(TRK,(1,1))
//A1 EXEC PGM=ASMA90,REGION=64M,PARM='OBJECT,NODECK'
//SYSLIB DD DSN=IMS.V15R1M0.SDFSMAC,DISP=SHR
//SYSLIN DD DSN=&&OBJ1,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
         PCB TYPE=DB,DBDNAME=TCBCKDB,PROCOPT=L,KEYLEN=4
         SENSEG NAME=CKPROOT,PARENT=0
         PSBGEN LANG=COBOL,PSBNAME=TCBCKPL,CMPAT=YES
         END
/*
//B1 EXEC PGM=IEWL,PARM='LIST,XREF',COND=(0,NE,A1)
//SYSLIN DD DSN=&&OBJ1,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=&&PSB(TCBCKPL),DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(TRK,(1,1))
//A2 EXEC PGM=ASMA90,REGION=64M,PARM='OBJECT,NODECK'
//SYSLIB DD DSN=IMS.V15R1M0.SDFSMAC,DISP=SHR
//SYSLIN DD DSN=&&OBJ2,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
         PCB TYPE=DB,DBDNAME=TCBCKDB,PROCOPT=A,KEYLEN=4
         SENSEG NAME=CKPROOT,PARENT=0
         PSBGEN LANG=COBOL,PSBNAME=TCBCKPU,CMPAT=YES
         END
/*
//B2 EXEC PGM=IEWL,PARM='LIST,XREF',COND=(0,NE,A2)
//SYSLIN DD DSN=&&OBJ2,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=&&PSB(TCBCKPU),DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(TRK,(1,1))
//CGEN EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&GENCKP,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=&SYSUID..TCBLAB.COBOL(GENCKP),DISP=SHR
//LGENCKP EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN DD DSN=&&GENCKP,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(GENCKP),DISP=(OLD,PASS)
//CCKP EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&CKP02,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=&SYSUID..TCBLAB.COBOL(CKP02),DISP=SHR
//LCKP02 EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN DD DSN=&&CKP02,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(CKP02),DISP=(OLD,PASS)
//CCHK EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&CHKCKP,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=&SYSUID..TCBLAB.COBOL(CHKCKP),DISP=SHR
//LCHKCKP EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN DD DSN=&&CHKCKP,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(CHKCKP),DISP=(OLD,PASS)
//CIMS EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&IMSCKP,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=&SYSUID..TCBLAB.COBOL(IMSCKP),DISP=SHR
//LIMS EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
// DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//SYSLIN DD DSN=&&IMSCKP,DISP=(OLD,DELETE)
// DD *
 ENTRY DLITCBL
/*
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(IMSCKP),DISP=(OLD,PASS)
//GENERATE EXEC PGM=GENCKP,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//PRINTDD DD SYSOUT=*,DCB=(RECFM=FB,LRECL=402,BLKSIZE=0)
//WORKDD DD DSN=&&WORK,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//EXP1DD DD DSN=&&EXP1,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//EXP2DD DD DSN=&&EXP2,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//EMPTYDD DD DSN=&&EMPTY,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//DBLOAD EXEC PGM=DFSRRC00,REGION=128M,COND=(4,LT),
// PARM=('DLI,IMSCKP,TCBCKPL,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//CEEDUMP DD SYSOUT=*
//IEFRDER DD DSN=&&LDBLOAD,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//CKPDB DD DSN=&&IMSDB,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=4096,
// BLKSIZE=4096)
//INPUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
//OUTPUT1 DD DUMMY
//SYSIN DD *
LOAD
/*
//EXPORT EXEC PGM=DFSRRC00,REGION=128M,COND=(4,LT),
// PARM=('DLI,IMSCKP,TCBCKPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//CEEDUMP DD SYSOUT=*
//IEFRDER DD DSN=&&LEXPORT,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//CKPDB DD DSN=&&IMSDB,DISP=(OLD,PASS)
//INPUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
//OUTPUT1 DD DSN=&&TRANSFER,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)
//SYSIN DD *
EXPORT
/*
//BASECHK EXEC PGM=DFSRRC00,REGION=128M,COND=(4,LT),
// PARM=('DLI,IMSCKP,TCBCKPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//CEEDUMP DD SYSOUT=*
//IEFRDER DD DSN=&&LBASECHK,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//CKPDB DD DSN=&&IMSDB,DISP=(OLD,PASS)
//INPUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
//OUTPUT1 DD DUMMY
//SYSIN DD *
CHECK
/*
//CONVERT EXEC PGM=CKP02,REGION=64M,COND=(4,LT)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//INPUT1 DD DSN=&&TRANSFER,DISP=(OLD,PASS)
//SYSOUT DD SYSOUT=*
//CHKFILE EXEC PGM=CHKCKP,REGION=64M,COND=(4,LT)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//ACTUALDD DD DSN=&&TRANSFER,DISP=(OLD,PASS)
//EXPECTDD DD DSN=&&EXP1,DISP=(OLD,PASS)
//BEFOREDD DD DSN=&&WORK,DISP=(OLD,PASS)
//SYSOUT DD SYSOUT=*
//ROLLBACK EXEC PGM=DFSRRC00,REGION=128M,COND=(4,LT),
// PARM=('DLI,IMSCKP,TCBCKPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//CEEDUMP DD SYSOUT=*
//IEFRDER DD DSN=&&LROLLBAC,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//CKPDB DD DSN=&&IMSDB,DISP=(OLD,PASS)
//INPUT1 DD DSN=&&TRANSFER,DISP=(OLD,PASS)
//OUTPUT1 DD DUMMY
//SYSIN DD *
ROLLBACK
/*
//UPDATE EXEC PGM=DFSRRC00,REGION=128M,COND=(4,LT),
// PARM=('DLI,IMSCKP,TCBCKPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//CEEDUMP DD SYSOUT=*
//IEFRDER DD DSN=&&LUPDATE,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//CKPDB DD DSN=&&IMSDB,DISP=(OLD,PASS)
//INPUT1 DD DSN=&&TRANSFER,DISP=(OLD,PASS)
//OUTPUT1 DD DUMMY
//SYSIN DD *
UPDATE
/*
//VERIFY EXEC PGM=DFSRRC00,REGION=128M,COND=(4,LT),
// PARM=('DLI,IMSCKP,TCBCKPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//CEEDUMP DD SYSOUT=*
//IEFRDER DD DSN=&&LVERIFY,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//CKPDB DD DSN=&&IMSDB,DISP=(OLD,PASS)
//INPUT1 DD DSN=&&TRANSFER,DISP=(OLD,PASS)
//OUTPUT1 DD DUMMY
//SYSIN DD *
CHECK
/*
//PROLLBAC EXEC PGM=DFSERA10,COND=(4,LT)
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//SYSUT1 DD DSN=&&LROLLBAC,DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
CONTROL  CNTL
OPTION   PRINT
END
/*
//PUPDATE EXEC PGM=DFSERA10,COND=(4,LT)
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//SYSUT1 DD DSN=&&LUPDATE,DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
CONTROL  CNTL
OPTION   PRINT
END
/*
