//TCBEVTS JOB (ACCT),'IMS EVENTS LAB',CLASS=A,MSGCLASS=H,
// MSGLEVEL=(1,1),NOTIFY=&SYSUID
//ALLOC EXEC PGM=IEFBR14
//LOAD DD DSN=&&LOAD,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
//DBD DD DSN=&&DBD,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
//PSB DD DSN=&&PSB,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
//A0 EXEC PGM=ASMA90,REGION=64M,PARM='OBJECT,NODECK',
// COND=(0,NE)
//SYSLIB DD DSN=IMS.V15R1M0.SDFSMAC,DISP=SHR
//SYSLIN DD DSN=&&OBJ0,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
         DBD NAME=TCBEVDB,ACCESS=(HDAM,OSAM),                          X
               RMNAME=(DFSHDC40,1,10,1000)
         DATASET DD1=EVTDB,SIZE=4096
         SEGM NAME=EVROOT,PARENT=0,BYTES=404
         FIELD NAME=(ROOTKEY,SEQ,U),BYTES=4,START=1,TYPE=C
         SEGM NAME=EVCHILD,PARENT=EVROOT,BYTES=20
         FIELD NAME=(CHILDKEY,SEQ,U),BYTES=4,START=1,TYPE=C
         DBDGEN
         FINISH
         END
/*
//B0 EXEC PGM=IEWL,PARM='LIST,XREF',COND=(0,NE,A0)
//SYSLIN DD DSN=&&OBJ0,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=&&DBD(TCBEVDB),DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(TRK,(1,1))
//A1 EXEC PGM=ASMA90,REGION=64M,PARM='OBJECT,NODECK',
// COND=(0,NE)
//SYSLIB DD DSN=IMS.V15R1M0.SDFSMAC,DISP=SHR
//SYSLIN DD DSN=&&OBJ1,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
         PCB TYPE=DB,DBDNAME=TCBEVDB,PROCOPT=L,KEYLEN=8
         SENSEG NAME=EVROOT,PARENT=0
         SENSEG NAME=EVCHILD,PARENT=EVROOT
         PSBGEN LANG=COBOL,PSBNAME=TCBEVPL,CMPAT=YES
         END
/*
//B1 EXEC PGM=IEWL,PARM='LIST,XREF',COND=(0,NE,A1)
//SYSLIN DD DSN=&&OBJ1,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=&&PSB(TCBEVPL),DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(TRK,(1,1))
//A2 EXEC PGM=ASMA90,REGION=64M,PARM='OBJECT,NODECK',
// COND=(0,NE)
//SYSLIB DD DSN=IMS.V15R1M0.SDFSMAC,DISP=SHR
//SYSLIN DD DSN=&&OBJ2,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=80)
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
         PCB TYPE=DB,DBDNAME=TCBEVDB,PROCOPT=A,KEYLEN=8
         SENSEG NAME=EVROOT,PARENT=0
         SENSEG NAME=EVCHILD,PARENT=EVROOT
         PSBGEN LANG=COBOL,PSBNAME=TCBEVPU,CMPAT=YES
         END
/*
//B2 EXEC PGM=IEWL,PARM='LIST,XREF',COND=(0,NE,A2)
//SYSLIN DD DSN=&&OBJ2,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=&&PSB(TCBEVPU),DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(TRK,(1,1))
//CIMS EXEC PGM=IGYCRCTL,REGION=256M,
// COND=(0,NE),
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&IMSEVT,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=&SYSUID..TCBLAB.COBOL(IMSEVT),DISP=SHR
//LIMS EXEC PGM=IEWL,PARM='LIST,MAP,XREF',COND=(0,NE)
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
// DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//SYSLIN DD DSN=&&IMSEVT,DISP=(OLD,DELETE)
// DD *
 ENTRY DLITCBL
/*
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(IMSEVT),DISP=(OLD,PASS)
//DBLOAD EXEC PGM=DFSRRC00,REGION=128M,COND=(0,NE),
// PARM=('DLI,IMSEVT,TCBEVPL,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LDBLOAD,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=4096,
// BLKSIZE=4096)
//SYSIN DD *
LOAD
/*
//NORMAL EXEC PGM=DFSRRC00,REGION=128M,COND=(0,NE),
// PARM=('DLI,IMSEVT,TCBEVPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LNORMAL,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(OLD,PASS,KEEP)
//SYSIN DD *
NORMAL
/*
//DUP EXEC PGM=DFSRRC00,REGION=128M,COND=(0,NE),
// PARM=('DLI,IMSEVT,TCBEVPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LDUP,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(OLD,PASS,KEEP)
//SYSIN DD *
DUP
/*
//CHECKB EXEC PGM=DFSRRC00,REGION=128M,COND=(0,NE),
// PARM=('DLI,IMSEVT,TCBEVPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LCHECKB,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(OLD,PASS,KEEP)
//SYSIN DD *
CHECK
/*
//DELAY EXEC PGM=DFSRRC00,REGION=128M,COND=(0,NE),
// PARM=('DLI,IMSEVT,TCBEVPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LDELAY,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(OLD,PASS,KEEP)
//SYSIN DD *
DELAY
/*
//PDUP EXEC PGM=DFSERA10,COND=(0,NE)
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//SYSUT1 DD DSN=&&LDUP,DISP=(OLD,PASS)
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
CONTROL  CNTL
OPTION   PRINT
END
/*
//CUT EXEC PGM=DFSRRC00,REGION=128M,COND=(0,NE),
// PARM=('DLI,IMSEVT,TCBEVPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LCUT,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(OLD,PASS,KEEP)
//SYSIN DD *
CUT
/*
//AFTERCUT IF (CUT.ABENDCC = U3001) THEN
//CHECKA EXEC PGM=DFSRRC00,REGION=128M,COND=EVEN,
// PARM=('DLI,IMSEVT,TCBEVPU,7,0000,,0,,N,0,T',
// ',,N,N,,Y')
//STEPLIB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
// DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//DFSRESLB DD DSN=IMS.V15R1M0.SDFSRESL,DISP=SHR
//IMS DD DSN=&&PSB,DISP=(OLD,PASS)
// DD DSN=&&DBD,DISP=(OLD,PASS)
//DFSVSAMP DD *
4096,20
/*
//PROCLIB DD DSN=IMS.V15R1M0.PROCLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD DUMMY
//CEEDUMP DD DUMMY
//IEFRDER DD DSN=&&LCHECKA,DISP=(NEW,PASS),
// UNIT=3390,VOL=SER=DEVVS1,STORCLAS=SCNOSMS,SPACE=(CYL,(1,1)),
// DCB=(RECFM=VB,LRECL=4092,BLKSIZE=4096)
//EVTDB DD DSN=&&EVTDB,DISP=(OLD,PASS,KEEP)
//SYSIN DD *
CHECK
/*
// ENDIF
