//TCBP001 JOB (ACCT),'TCB CKP02 LAB',CLASS=A,MSGCLASS=H,
// MSGLEVEL=(1,1),NOTIFY=&SYSUID
//* Each job owns its temporary data; no production datasets.
//ALLOC EXEC PGM=IEFBR14
//LOAD DD DSN=&&LOAD,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(2,1,10)),DSNTYPE=LIBRARY,DCB=(RECFM=U)
// IF (ALLOC.RC EQ 0) THEN
//CGEN EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&GENCKP,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=YOURUSER.TCBLAB.COBOL(GENCKP),DISP=SHR
// IF (CGEN.RC LE 4) THEN
//LGENCKP EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN DD DSN=&&GENCKP,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(GENCKP),DISP=(OLD,PASS)
// ENDIF
//CCKP EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&CKP02,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=YOURUSER.TCBLAB.COBOL(CKP02),DISP=SHR
// IF (CCKP.RC LE 4) THEN
//LCKP02 EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN DD DSN=&&CKP02,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(CKP02),DISP=(OLD,PASS)
// ENDIF
//CCHK EXEC PGM=IGYCRCTL,REGION=256M,
// PARM='LIB,OBJECT,RENT,LIST,MAP,XREF,CODEPAGE(937),DBCS'
//STEPLIB DD DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&CHKCKP,DISP=(NEW,PASS),
// UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(5,5)),DCB=(RECFM=FB,LRECL=80)
//SYSMDECK DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1))
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT4 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT5 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT6 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT7 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT8 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT9 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT10 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT11 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT12 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT13 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT14 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSUT15 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSIN DD DSN=YOURUSER.TCBLAB.COBOL(CHKCKP),DISP=SHR
// IF (CCHK.RC LE 4) THEN
//LCHKCKP EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSLIB DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN DD DSN=&&CHKCKP,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(CYL,(1,1))
//SYSLMOD DD DSN=&&LOAD(CHKCKP),DISP=(OLD,PASS)
// ENDIF
// IF ((CGEN.RC LE 4) & (LGENCKP.RC EQ 0) &
// (CCKP.RC LE 4) & (LCKP02.RC EQ 0) &
// (CCHK.RC LE 4) & (LCHKCKP.RC EQ 0)) THEN
//GENERATE EXEC PGM=GENCKP,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//PRINTDD DD SYSOUT=*,DCB=(RECFM=FB,LRECL=402,BLKSIZE=0)
//WORKDD DD DSN=&&WORK,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//EXP1DD DD DSN=&&EXP1,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//EXP2DD DD DSN=&&EXP2,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
//EMPTYDD DD DSN=&&EMPTY,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
// IF (GENERATE.RC EQ 0) THEN
//SNAP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY
//SYSUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
//SYSUT2 DD DSN=&&BEFORE1,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
// IF (SNAP1.RC EQ 0) THEN
//RUNONCE EXEC PGM=CKP02,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//INPUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
// IF (RUNONCE.RC EQ 0) THEN
//CHECK1 EXEC PGM=CHKCKP,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//ACTUALDD DD DSN=&&WORK,DISP=(OLD,PASS)
//EXPECTDD DD DSN=&&EXP1,DISP=(OLD,PASS)
//BEFOREDD DD DSN=&&BEFORE1,DISP=(OLD,PASS)
// IF (CHECK1.RC EQ 0) THEN
//SNAP2 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY
//SYSUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
//SYSUT2 DD DSN=&&BEFORE2,DISP=(NEW,PASS),UNIT=3390,
// VOL=SER=DEVVS1,STORCLAS=SCNOSMS,
// SPACE=(TRK,(1,1)),DCB=(DSORG=PS,RECFM=FB,LRECL=400,
// BLKSIZE=0)
// IF (SNAP2.RC EQ 0) THEN
//RUNTWICE EXEC PGM=CKP02,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//INPUT1 DD DSN=&&WORK,DISP=(OLD,PASS)
// IF (RUNTWICE.RC EQ 0) THEN
//CHECK2 EXEC PGM=CHKCKP,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//ACTUALDD DD DSN=&&WORK,DISP=(OLD,PASS)
//EXPECTDD DD DSN=&&EXP2,DISP=(OLD,PASS)
//BEFOREDD DD DSN=&&BEFORE2,DISP=(OLD,PASS)
//RUNEMPTY EXEC PGM=CKP02,REGION=64M,TIME=(0,1)
//STEPLIB DD DSN=&&LOAD,DISP=(OLD,PASS)
// DD DSN=CEE.SCEERUN,DISP=SHR
//SYSOUT DD SYSOUT=*
//CEEDUMP DD DUMMY
//SYSUDUMP DD DUMMY
//INPUT1 DD DSN=&&EMPTY,DISP=(OLD,PASS)
// ENDIF
// ENDIF
// ENDIF
// ENDIF
// ENDIF
// ENDIF
// ENDIF
// ENDIF
