      ****************************************************************  
       01  COUNT-3                     PIC S9(5)  COMP VALUE +3.        
       01  COUNT-4                     PIC S9(5)  COMP VALUE +4.        
       01  FUNCTION-GU                 PIC X(4)        VALUE "GU  ".    
       01  FUNCTION-GN                 PIC X(4)        VALUE "GN  ".    
       01  FUNCTION-GNP                PIC X(4)        VALUE "GNP ".    
       01  FUNCTION-GHU                PIC X(4)        VALUE "GHU ".    
       01  FUNCTION-GHN                PIC X(4)        VALUE "GHN ".    
       01  FUNCTION-GHNP               PIC X(4)        VALUE "GHNP".    
       01  FUNCTION-ISRT               PIC X(4)        VALUE "ISRT".    
       01  FUNCTION-REPL               PIC X(4)        VALUE "REPL".    
       01  FUNCTION-DLET               PIC X(4)        VALUE "DLET".    
       01  FUNCTION-SYNC               PIC X(4)        VALUE "SYNC".    
       01  FUNCTION-ROLB               PIC X(4)        VALUE "ROLB".    
       01  FUNCTION-CHNG               PIC X(4)        VALUE "CHNG".    
       01  FUNCTION-PURG               PIC X(4)        VALUE "PURG".    
21220A 01  FUNCTION-RLSE               PIC X(4)        VALUE "RLSE".    
