       01  ATPCB.                                                       
           02  AT-DBDNAME              PIC X(8).                        
           02  AT-LEVEL-NUMBER         PIC XX.                          
           02  AT-STATUS-CODE          PIC XX.                          
           02  AT-PROC-OPTIONS         PIC X(4).                        
           02  AT-JCB-ADDRESS          PIC X(4).                        
           02  AT-SEGMENT-NAME         PIC X(8).                        
           02  AT-KEY-LENGTH           PIC S9(5) COMP.                  
           02  AT-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  AT-KEY-FEEDBACK         PIC X(30).                       
