       01  ABPCB.                                                       
           02  AB-DBDNAME              PIC X(8).                        
           02  AB-LEVEL-NUMBER         PIC XX.                          
           02  AB-STATUS-CODE          PIC XX.                          
           02  AB-PROC-OPTIONS         PIC X(4).                        
           02  AB-JCB-ADDRESS          PIC X(4).                        
           02  AB-SEGMENT-NAME         PIC X(8).                        
           02  AB-KEY-LENGTH           PIC S9(5) COMP.                  
           02  AB-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  AB-KEY-FEEDBACK         PIC X(30).                       
