       01  BTPCB.                                                       
           02  BT-DBDNAME              PIC X(8).                        
           02  BT-LEVEL-NUMBER         PIC XX.                          
           02  BT-STATUS-CODE          PIC XX.                          
           02  BT-PROC-OPTIONS         PIC X(4).                        
           02  BT-JCB-ADDRESS          PIC X(4).                        
           02  BT-SEGMENT-NAME         PIC X(8).                        
           02  BT-KEY-LENGTH           PIC S9(5) COMP.                  
           02  BT-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  BT-KEY-FEEDBACK         PIC X(30).                       
