       01  BCPCB.                                                       
           02  BC-DBDNAME              PIC X(8).                        
           02  BC-LEVEL-NUMBER         PIC XX.                          
           02  BC-STATUS-CODE          PIC XX.                          
           02  BC-PROC-OPTIONS         PIC X(4).                        
           02  BC-JCB-ADDRESS          PIC X(4).                        
           02  BC-SEGMENT-NAME         PIC X(8).                        
           02  BC-KEY-LENGTH           PIC S9(5) COMP.                  
           02  BC-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  BC-KEY-FEEDBACK         PIC X(30).                       
