       01  BMPCB.                                                       
           02  BM-DBDNAME              PIC X(8).                        
           02  BM-LEVEL-NUMBER         PIC XX.                          
           02  BM-STATUS-CODE          PIC XX.                          
           02  BM-PROC-OPTIONS         PIC X(4).                        
           02  BM-JCB-ADDRESS          PIC X(4).                        
           02  BM-SEGMENT-NAME         PIC X(8).                        
           02  BM-KEY-LENGTH           PIC S9(5) COMP.                  
           02  BM-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  BM-KEY-FEEDBACK         PIC X(30).                       
