       01  CHPCB.                                                       
           02  CH-DBDNAME              PIC X(8).                        
           02  CH-LEVEL-NUMBER         PIC XX.                          
           02  CH-STATUS-CODE          PIC XX.                          
           02  CH-PROC-OPTIONS         PIC X(4).                        
           02  CH-JCB-ADDRESS          PIC X(4).                        
           02  CH-SEGMENT-NAME         PIC X(8).                        
           02  CH-KEY-LENGTH           PIC S9(5) COMP.                  
           02  CH-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  CH-KEY-FEEDBACK         PIC X(30).                       
