       01  CLPCB.                                                       
           02  CL-DBDNAME              PIC X(8).                        
           02  CL-LEVEL-NUMBER         PIC XX.                          
           02  CL-STATUS-CODE          PIC XX.                          
           02  CL-PROC-OPTIONS         PIC X(4).                        
           02  CL-JCB-ADDRESS          PIC X(4).                        
           02  CL-SEGMENT-NAME         PIC X(8).                        
           02  CL-KEY-LENGTH           PIC S9(5) COMP.                  
           02  CL-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  CL-KEY-FEEDBACL         PIC X(40).                       
