       01  CNPCB.                                                       
           02  CN-DBDNAME              PIC X(8).                        
           02  CN-LEVEL-NUMBER         PIC XX.                          
           02  CN-STATUS-CODE          PIC XX.                          
           02  CN-PROC-OPTIONS         PIC X(4).                        
           02  CN-JCB-ADDRESS          PIC X(4).                        
           02  CN-SEGMENT-NAME         PIC X(8).                        
           02  CN-KEY-LENGTH           PIC S9(5) COMP.                  
           02  CN-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  CN-KEY-FEEDBACK         PIC X(30).                       
