       01  FTPCB.                                                       
           02  FT-DBDNAME              PIC X(8).                        
           02  FT-LEVEL-NUMBER         PIC XX.                          
           02  FT-STATUS-CODE          PIC XX.                          
           02  FT-PROC-OPTIONS         PIC X(4).                        
           02  FT-JCB-ADDRESS          PIC X(4).                        
           02  FT-SEGMENT-NAME         PIC X(8).                        
           02  FT-KEY-LENGTH           PIC S9(5) COMP.                  
           02  FT-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  FT-KEY-FEEDBACK         PIC X(30).                       
