       01  FRPCB.                                                       
           02  FR-DBDNAME              PIC X(8).                        
           02  FR-LEVEL-NUMBER         PIC XX.                          
           02  FR-STATUS-CODE          PIC XX.                          
           02  FR-PROC-OPTIONS         PIC X(4).                        
           02  FR-JCB-ADDRESS          PIC X(4).                        
           02  FR-SEGMENT-NAME         PIC X(8).                        
           02  FR-KEY-LENGTH           PIC S9(5) COMP.                  
           02  FR-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  FR-KEY-FEEDBACK         PIC X(30).                       
