       01  GAPCB.                                                       
           02  GA-DBDNAME              PIC X(8).                        
           02  GA-LEVEL-NUMBER         PIC XX.                          
           02  GA-STATUS-CODE          PIC XX.                          
           02  GA-PROC-OPTIONS         PIC X(4).                        
           02  GA-JCB-ADDRESS          PIC X(4).                        
           02  GA-SEGMENT-NAME         PIC X(8).                        
           02  GA-KEY-LENGTH           PIC S9(5) COMP.                  
           02  GA-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  GA-KEY-FEEDBACK         PIC X(30).                       
