       01  IBPCB.                                                       
           02  IB-DBDNAME              PIC X(8).                        
           02  IB-LEVEL-NUMBER         PIC XX.                          
           02  IB-STATUS-CODE          PIC XX.                          
           02  IB-PROC-OPTIONS         PIC X(4).                        
           02  IB-JCB-ADDRESS          PIC X(4).                        
           02  IB-SEGMENT-NAME         PIC X(8).                        
           02  IB-KEY-LENGTH           PIC S9(5) COMP.                  
           02  IB-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  IB-KEY-FEEDBACK         PIC X(30).                       
