       01  IPPCB.                                                       
           02  IP-DBDNAME              PIC X(8).                        
           02  IP-LEVEL-NUMBER         PIC XX.                          
           02  IP-STATUS-CODE          PIC XX.                          
           02  IP-PROC-OPTIONS         PIC X(4).                        
           02  IP-JCB-ADDRESS          PIC X(4).                        
           02  IP-SEGMENT-NAME         PIC X(8).                        
           02  IP-KEY-LENGTH           PIC S9(5) COMP.                  
           02  IP-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  IP-KEY-FEEDBAIP         PIC X(40).                       
