       01  LAPCB.                                                       
           02  LA-DBDNAME              PIC X(8).                        
           02  LA-LEVEL-NUMBER         PIC XX.                          
           02  LA-STATUS-CODE          PIC XX.                          
           02  LA-PROC-OPTIONS         PIC X(4).                        
           02  LA-JCB-ADDRESS          PIC X(4).                        
           02  LA-SEGMENT-NAME         PIC X(8).                        
           02  LA-KEY-LENGTH           PIC S9(5) COMP.                  
           02  LA-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  LA-KEY-FEEDBACK         PIC X(30).                       
