       01  LCPCB.                                                       
           02  LC-DBDNAME              PIC X(8).                        
           02  LC-LEVEL-NUMBER         PIC XX.                          
           02  LC-STATUS-CODE          PIC XX.                          
           02  LC-PROC-OPTIONS         PIC X(4).                        
           02  LC-JCB-ADDRESS          PIC X(4).                        
           02  LC-SEGMENT-NAME         PIC X(8).                        
           02  LC-KEY-LENGTH           PIC S9(5) COMP.                  
           02  LC-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  LC-KEY-FEEDBACK         PIC X(30).                       
