       01  MBPCB.                                                       
           02  MB-DBDNAME              PIC X(8).                        
           02  MB-LEVEL-NUMBER         PIC XX.                          
           02  MB-STATUS-CODE          PIC XX.                          
           02  MB-PROC-OPTIONS         PIC X(4).                        
           02  MB-JCB-ADDRESS          PIC X(4).                        
           02  MB-SEGMENT-NAME         PIC X(8).                        
           02  MB-KEY-LENGTH           PIC S9(5) COMP.                  
           02  MB-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  MB-KEY-FEEDBACK         PIC X(30).                       
