       01  RTPCB.                                                       
           02  RT-DBDNAME              PIC X(8).                        
           02  RT-LEVEL-NUMBER         PIC XX.                          
           02  RT-STATUS-CODE          PIC XX.                          
           02  RT-PROC-OPTIONS         PIC X(4).                        
           02  RT-JCB-ADDRESS          PIC X(4).                        
           02  RT-SEGMENT-NAME         PIC X(8).                        
           02  RT-KEY-LENGTH           PIC S9(5) COMP.                  
           02  RT-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  RT-KEY-FEEDBACK         PIC X(30).                       
