       01  TSPCB.                                                       
           02  TS-DBDNAME              PIC X(8).                        
           02  TS-LEVEL-NUMBER         PIC XX.                          
           02  TS-STATUS-CODE          PIC XX.                          
           02  TS-PROC-OPTIONS         PIC X(4).                        
           02  TS-JCB-ADDRESS          PIC X(4).                        
           02  TS-SEGMENT-NAME         PIC X(8).                        
           02  TS-KEY-LENGTH           PIC S9(5) COMP.                  
           02  TS-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  TS-KEY-FEEDBACK         PIC X(30).                       
