       01  TDPCB.                                                       
           02  TD-DBDNAME              PIC X(8).                        
           02  TD-LEVEL-NUMBER         PIC XX.                          
           02  TD-STATUS-CODE          PIC XX.                          
           02  TD-PROC-OPTIONS         PIC X(4).                        
           02  TD-JCB-ADDRESS          PIC X(4).                        
           02  TD-SEGMENT-NAME         PIC X(8).                        
           02  TD-KEY-LENGTH           PIC S9(5) COMP.                  
           02  TD-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  TD-KEY-FEEDBACK         PIC X(30).                       
