       01  TRPCB.                                                       
           02  TR-DBDNAME              PIC X(8).                        
           02  TR-LEVEL-NUMBER         PIC XX.                          
           02  TR-STATUS-CODE          PIC XX.                          
           02  TR-PROC-OPTIONS         PIC X(4).                        
           02  TR-JCB-ADDRESS          PIC X(4).                        
           02  TR-SEGMENT-NAME         PIC X(8).                        
           02  TR-KEY-LENGTH           PIC S9(5) COMP.                  
           02  TR-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  TR-KEY-FEEDBACK         PIC X(30).                       
