       01  TCPCB.                                                       
           02  TC-DBDNAME              PIC X(8).                        
           02  TC-LEVEL-NUMBER         PIC XX.                          
           02  TC-STATUS-CODE          PIC XX.                          
           02  TC-PROC-OPTIONS         PIC X(4).                        
           02  TC-JCB-ADDRESS          PIC X(4).                        
           02  TC-SEGMENT-NAME         PIC X(8).                        
           02  TC-KEY-LENGTH           PIC S9(5) COMP.                  
           02  TC-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  TC-KEY-FEEDBACK         PIC X(30).                       
