       01  VDPCB.                                                       
           02  VD-DBDNAME              PIC X(8).                        
           02  VD-LEVEL-NUMBER         PIC XX.                          
           02  VD-STATUS-CODE          PIC XX.                          
           02  VD-PROC-OPTIONS         PIC X(4).                        
           02  VD-JCB-ADDRESS          PIC X(4).                        
           02  VD-SEGMENT-NAME         PIC X(8).                        
           02  VD-KEY-LENGTH           PIC S9(5) COMP.                  
           02  VD-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  VD-KEY-FEEDBACK         PIC X(30).                       
