       01  VAPCB.                                                       
           02  VA-DBDNAME              PIC X(8).                        
           02  VA-LEVEL-NUMBER         PIC XX.                          
           02  VA-STATUS-CODE          PIC XX.                          
           02  VA-PROC-OPTIONS         PIC X(4).                        
           02  VA-JCB-ADDRESS          PIC X(4).                        
           02  VA-SEGMENT-NAME         PIC X(8).                        
           02  VA-KEY-LENGTH           PIC S9(5) COMP.                  
           02  VA-NUMBER-SEGS          PIC S9(5) COMP.                  
           02  VA-KEY-FEEDBACK         PIC X(30).                       
